[
  {
    "title": "Hippocampal & Striatal navigation",
    "description": "Behavioural and neural data suggest that multiple strategies and brain systems support learning about reward. Reinforcement learning (RL) considers these strategies in terms of model-based (MB) learning, which involves learning an explicit transition model of the available state-space, or model-free (MF) learning, which involves directly estimating the cumulative future reward associated with each state. The MB-MF distinction parallels that between place learning and response learning within spatial navigation. Lesion and inactivation studies suggests that dorsal hippocampus (dHC) underlies both MB and place learning, whereas dorsolateral striatum (DLS) underlies MF and response learning. Here, we present a computational model of the dHC and DLS contributions to reward learning that applies to spatial and nonspatial domains. In the model, hippocampal place cell firing reflects the geodesic distance of other states from its preferred state along the graph of task structure. Accordingly, this population can support a value function or goal cell firing rate, via one-shot learning, on which gradient ascent corresponds to taking the shortest path on the graph, behaviour associated with MB planning. In contrast, the DLS learns through MF stimulus-response associations with egocentric environmental cues. We show that this model reproduces animal behaviour on spatial navigation tasks using the Morris Water Maze and the Plus Maze, and human behaviour on non-spatial two-step decision tasks. We discuss how the geodesic place cell fields could be learnt, and how this type of representation helps to span the gap between MB and MF learning. The generality of our model, originally shaped by detailed constraints in the spatial literature, suggests that the hippocampal-striatal system is a general-purpose learning device that adaptively combines MB and MF mechanisms.  \n\n[Code location](https://github.com/bicanski/HBPcollab/tree/master/Striatal_v_hippocampal_nav)\n\n[Detailed description of simulations and results](https://github.com/bicanski/HBPcollab/blob/master/Striatal_v_hippocampal_nav_v2/Modelling_hippocampal_and_dorsolateral_striatal_contributions_to_learning_across_domains.pdf)",
    "contributors": [
      "Geerts, Jesse",
      "Burgess, Neil"
    ],
    "owners": [
      "Burgess, Neil"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Hippocampal formation as a hierarchical generative model",
    "description": "This is a computational model that casts the hippocampal formation as a hierarchical generative model that organizes sequential experiences, such as such as rodent trajectories during spatial navigation, into coherent spatiotemporal contexts. The model addresses the formation of spatial maps (in the hippocampus) and the the offline resampling of fictive sequences from the generative model (aka generative replay) for the sake of continual learning of multiple sequential experiences. It reproduces several empirical findings on internally generated hippocampal sequences (e.g., replays). It can also be used to analyze the spatial codes that emerge in the hippocampus during spatial learning; and replay dynamics. \n\nThe computational model is described in the preprint publication P2331: Stoianov I., Maisto D., Pezzulo G., (2020) The hippocampal formation as a hierarchical generative model supporting generative replay and continual learning. BiorXiv preprint: <a href=\"https://www.biorxiv.org/content/10.1101/2020.01.16.908889v1.full\">https://www.biorxiv.org/content/10.1101/2020.01.16.908889v1.full</a>",
    "contributors": [
      "Pezzulo, Giovanni",
      "Stoianov, Ivilin Peev",
      "Maisto, Domenico"
    ],
    "owners": [
      "Pezzulo, Giovanni"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Dendritic processing in hippocampal pyramidal cells - Kali & Freund, 2004",
    "description": "Area CA1 of the hippocampus contains a population of pyramidal cells, accompanied by a diverse array of inhibitory interneurons, which are believed to modulate the activity and plasticity of pyramidal neurons. \nThis model creates detailed models of hippocampal principal cells and interneurons, which can be used to explore how these different cell types interact within the hippocampal network.\n\nThe model is further described in:\n\nS. Kali, T.F. Freund (2004) Dendritic processing in hippocampal pyramidal cells and its modulation by inhibitory interneurons. *Proceedings of the 2004 IEEE International Joint Conference on Neural Networks* [doi:10.1109/IJCNN.2004.1379985](http://doi.org/10.1109/IJCNN.2004.1379985)",
    "contributors": [
      "Káli, Szabolcs",
      "Freund, Tamas F."
    ],
    "owners": [
      "Káli, Szabolcs"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Bayesian network models for analyzing morphological structure of hippocampal CA1 pyramidal neurons",
    "description": "This repository contains the Bayesian network models underlying our paper, [‘Comparing basal dendrite branches in human and mouse hippocampal CA1 pyramidal neurons with Bayesian networks’](https://www.biorxiv.org/content/10.1101/2020.03.14.991828v1). There is detailed documentation on the models in the paper. The models are [`bnlearn`](https://cran.r-project.org/web/packages/bnlearn/index.html) objects. You can use them for analyzing structure and conditional independencies as well as for probabilistic inference. There is detailed documentation on the networks in the paper.",
    "contributors": [
      "Mihaljević, Bojan ",
      "Larrañaga, Pedro",
      "Benavides-Piccione, Ruth",
      "DeFelipe, Javier",
      "Bielza, Concha"
    ],
    "owners": [
      "Mihaljević, Bojan "
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Collection of hippocampal CA1 pyramidal cell and interneuron models - Migliore et al. 2018",
    "description": "Neuron models associated with:\n\nMigliore R, Lupascu CA, Bologna LL, Romani A, Courcol J-D, Antonel S, et al. (2018) The physiological variability of channel density in hippocampal CA1 pyramidal cells and interneurons explored using a unified data-driven modeling workflow. PLoS Comput Biol 14(9): e1006423. [https://doi.org/10.1371/journal.pcbi.1006423](https://doi.org/10.1371/journal.pcbi.1006423)\n\nalso see: \n \n- [Live paper](https://humanbrainproject.github.io/hbp-bsp-live-papers/2018/migliore_et_al_2018/migliore_et_al_2018.html)\n- [ModelDB entry](https://senselab.med.yale.edu/modeldb/enterCode.cshtml?model=244688#tabs-1)",
    "contributors": [
      "Migliore, Rosanna",
      "Lupascu, Carmen A.",
      "Bologna, Luca",
      "Romani, Armando",
      "Courcol, Jean-Denis",
      "Antonel, Stefano",
      "Van Geit, Werner",
      "Thomson, Alex",
      "Mercer, Audrey",
      "Lange, Sigrun",
      "Falck, Joanne",
      "Rössert, Christian",
      "Shi, Ying",
      "Hagens, Olivier",
      "Pezzoli, Maurizio",
      "Freund, Tamas F.",
      "Káli, Szabolcs",
      "Muller, Eilif",
      "Schürmann, Felix",
      "Markram, Henry",
      "Migliore, Michele"
    ],
    "owners": [
      "Migliore, Michele"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Rat Hippocampus CA1",
    "description": "Reconstruction of a full-scale rat hippocampus CA1.\n\nAuthors only include first author and PIs in alphabetic order. The list of authors will be finalized at the time of publication.\n\nUsage. To use the model, you have to:\n1. copy the model to your cluster\n2. go to circuit/connectome/functional and follow instructions in README file\n3. update the paths in in circuit/CircuitConfig\n4. steps 1-3 are sufficient to enable you to analyze the circuit\n5. for simulation, you can use either the BSP SimUI or the BBP Neurodamus",
    "contributors": [
      "Romani, Armando",
      "Káli, Szabolcs",
      "Markram, Henry",
      "Mercer, Audrey",
      "Migliore, Michele",
      "Thomson, Alex"
    ],
    "owners": [
      "Romani, Armando"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "The hippocampus-ventral striatum circuit model in the Neurorobotics Platform",
    "description": "### Introduction\n\nThe hippocampus is a complex structure of the brain which is part of the limbic system, and it is mainly involved in the development of long-term memory and spatial memory. In fact, the hippocampus makes use of the grid cells present in the entorhinal cortex to generate place cells, specific types of neurons that fire when the animal enters a particular place in the environment. What allows an animal to learn how to navigate in this environment is the basal ganglia (BG) circuit, composed of many subnuclei located in different areas of the brain: this circuit, thanks to a neurotransmitter called dopamine, changes the synaptic strengths of the striatum, a subnucleus of the BG, and makes the animal be able to select actions in its environment in order to maximize some reward, a mechanism very similar to reinforcement learning.\n\nStoianov et al. proposed a probabilistic model which simulates the functioning of these neural circuits, and tested it on three different tasks on a Y-maze environment: in the first task (cue conditioning), every final position had a 100% probability to give a reward, while on the second task (context conditioning) the reward probabilities varied depending on the room; finally, a third task was performed (contextual conditioning) with reward probabilities of 0% in order to check the spatial preferences learned by the robot during the previous phases of training. The rodent was able to find out the reward locations that yielded a higher probability to get the reward. However, the model was tested on a simple environment without a realistic agent and sensors, though a noise term was added for the retrieval of the position and direction of the rodent, and for the execution of the actions.\n\nIn order to find out how this model would perform in a realistic scenario, we integrated it on the NRP and performed simulations on more complex environments. The NRP is a simulation infrastructure that aims to bridge the gap between neuroscience and robotics by providing biologically realistic brain models to virtually embodied agents, and vice versa. For these simulations, we employed the Husky robot, an unmanned ground vehicle (UGV) with four wheels and realistic sensors.\n\n### NRP Integration\n\nIn order to integrate the Matlab model in the Neurorobotics Platform (NRP), we utilized the Matlab engine, a Python package that allows executing Matlab function from Python scripts. The simulation environment, including initialization of the world, execution of actions and visiting reward locations, is handled by the NRP, while the Matlab functions for control and learning are called from Python through the Matlab engine.\n\nAs illustrated in Fig. 1, we tested the model on three different mazes: a simple grid with 8 reward locations, a T-maze with 6 reward locations, and a 4 rooms environment with 12 reward locations. The Husky robot uses a physically realistic laser scan to check if there are obstacles nearby, in order to stop when it is approaching a wall.\n\n![Figure 1](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/Falotico/hippocampus-ventral-striatum/figures/fig1_900px.png)\n\n### Results\n\nFig. 2 shows the metric scores for the simple environment, Fig. 3 represents the scores for the T-maze, while Fig. 4 shows the scores for the 4 rooms environment. Both simulations consisted of 1000 trials.\n\nIn order to assess the model performances in a robotic scenario, we relied on the four metrics used on the original work: (i) accuracy (number of trials where the rodent finds a reward location over the number of trials); (ii) path length of each trial (a lower path length means that the rodent found the reward location in few steps); (iii) sweep depth for each trial; (iv) decision certainty of the rodent.\n\nAs can be seen from the scores, the Husky robot is able to learn the first two tasks, while the decision certainty decreases; on the other hand, it has more difficulties learning the third task, due to the increased complexity of the environment.\n\n![Figure 2](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/Falotico/hippocampus-ventral-striatum/figures/fig2_600px.png)\n![Figure 3](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/Falotico/hippocampus-ventral-striatum/figures/fig3_600px.png)\n![Figure 4](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/Falotico/hippocampus-ventral-striatum/figures/fig4_600px.png)\n",
    "contributors": [
      "Priorelli,  Matteo",
      "Kirtay, Murat",
      "Stoianov, Ivilin Peev",
      "Pezzulo, Giovanni",
      "Falotico, Egidio"
    ],
    "owners": [
      "Falotico, Egidio"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Model-based spatial navigation in the hippocampus - ventral striatum circuit",
    "description": "The computational model explores the links between model-based reinforcement learning (MB-RL) and the functioning of the hippocampus (HC) and the ventral striatum (vStr)–a neuronal circuit that increasingly recognized to be an appropriate model system to understand goal-directed (spatial) decisions and planning mechanisms in the brain.\n\nThe model is fully described in \"Stoianov IP, Pennartz CMA, Lansink CS, Pezzulo G (2018) Model-based spatial navigation in the hippocampus-ventral striatum circuit: A computational analysis. PLoS Comput Biol 14(9): e1006316. <a href=\"https://doi.org/10.1371/journal.pcbi.1006316\">https://doi.org/10.1371/journal.pcbi.1006316</a>\"",
    "contributors": [
      "Pezzulo, Giovanni",
      "Stoianov, Ivilin Peev"
    ],
    "owners": [
      "Pezzulo, Giovanni"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "CA1 hypofunction in schizophrenia",
    "description": "A model of CA1 pyramidal neurons, as described in:\n\nM. Migliore, I. De Blasi, D. Tegolo, R. Migliore\nA modeling study suggesting how a reduction in the context-dependent input on CA1 pyramidal neurons could generate schizophrenic behavior.\nNeural Networks,(2011) <a href=\"https://doi.org/doi:10.1016/j.neunet.2011.01.001\">doi:10.1016/j.neunet.2011.01.001</a>\n\nThe model allow to investigate how and to what extent a pathological hypofunction of a context-dependent distal input on a CA1 neuron alters the normal recall of objects on which the neuron has been previously tuned.\n",
    "contributors": [
      "Migliore, Michele",
      "De Blasi, Ignazio",
      "Tegolo, Domenico",
      "Migliore, Rosanna"
    ],
    "owners": [
      "Migliore, Rosanna"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Golding_dichotomy",
    "description": "A model of CA1 pyramidal neurons, as described in:\r\n\r\nGolding NL, Kath WL, Spruston N (2001) Dichotomy of action-potential backpropagation in CA1 pyramidal neuron dendrites. J Neurophysiol 86:2998-3010\r\n\r\nAlso see: https://senselab.med.yale.edu/modeldb/showModel.cshtml?model=64167",
    "contributors": [
      "Spruston, Nelson",
      "Golding, Nace L",
      "Kath, William L",
      "Mickus, Timothy"
    ],
    "owners": [
      "Mickus, Timothy"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Mechanisms of the depolarization block in CA1 pyramidal neurons - Bianchi et al., 2012",
    "description": "A model of CA1 pyramidal neurons, as described in\n\nD.Bianchi, A. Marasco, A.Limongiello, C.Marchetti, H.Marie, B.Tirozzi, M.Migliore (2012) On the mechanisms underlying the depolarization block in the spiking dynamics of CA1 pyramidal neurons. J Comput Neurosci. [https://doi.org/10.1007/s10827-012-0383-y](https://doi.org/10.1007/s10827-012-0383-y)\n\nThis model allow to analyze the spiking dynamics of CA1 pyramidal neuron using the same set of ionic currents on both an accurate morphological reconstruction and on its reduction to a single-compartment. This model allow to analyze the specific ion channel properties and kinetics that are needed to reproduce experimental findings, and how their interplay can drastically modulate the neuronal dynamics and the input current range leading to a depolarization block.",
    "contributors": [
      "Bianchi, Daniela",
      "Marasco, Addolorata",
      "Limongiello, Alessandro",
      "Marchetti, Cristina",
      "Marie, Hélène",
      "Tirozzi, Brunello",
      "Migliore, Michele"
    ],
    "owners": [
      "Migliore, Michele"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  },
  {
    "title": "Macroscopic model of brain function",
    "description": "This work, co-supervised in Destexhe and Jirsa groups, aims at connecting empirical knowledge across scales from microscopic (nanometers to micrometers—molecules to whole neurons) to macroscopic brain activity (centimeters to meters—brain areas to individual subjects' brains) with theoretical tools (Goldman et al. 2019). Not unlike how microscopic interactions between molecules underlie structures formed in macroscopic states of matter, using statistical physics, the dynamics of microscopic neural phenomena can be linked to macroscopic brain dynamics through mesoscopic scales. While statistical physics has been utile to describe the patterns of pair-wise and population-wide correlations at the microscopic scale in brain research (Nghiem, Telenczuk, et al. 2018; Schneidman et al. 2006) such tools have not yet been employed to formally bridge from microscopic to macroscopic scales. \n\nHere, methods for the macroscopic quantification of neural activity are introduced (Equations 1 and 2, Fig.1) and used to quantify global brain dynamics in states spanning deep sleep to resting and active wakefulness. In essence, spectral energy (U; equation 1) is defined as the integral under the Fourier power spectrum and the spectral entropy (H; equation 2) is defined as the log of the empirical probability distribution of frequencies (P(f)). These measures are made from each subject and each sensor in short time epochs, acknowledging that brain activity is constantly in flux. In magnetoencephalography (MEG) signals from healthy human subjects in resting (Fig.2A top) and active (Fig.2A bottom) states, effective energy and entropy measurements were made from power spectra (Fig.2B) for each epoch. Plotting the energy and entropy for each epoch from one subject, a robust linear relationship between the spectral energy and entropy is apparent (Fig.2C). Histograms show a shift of entropy to higher values and a shift of energy to lower values during active waking compared to resting wakefulness.  \n\nExamining the mean effective energy and entropy for each subject, it is clear that entropy robustly increases (Fig.2D) whereas energy robustly decreases (Fig.2E) during active waking compared to rest. Further, this conserved relationship between mean effective energy and entropy is also observed in electroencephalography data from subjects ranging from deep sleep to wake (Fig.2F). To test whether increased coupling between the system’s components and therefore synchrony could account for the higher energy and lower entropy during less active brain states, coupling was systematically varied in a network of coupled Kuramoto oscillators. Indeed, enhanced coupling can result in lower entropy, higher energy signals (Fig.3). The results indicate that macroscopically observed high synchrony, low complexity brain signals recorded during unconscious states may be accounted for by an increased coupling in the system's components, behaving more like a solid (Peyrache et al. 2012; Le Van Quyen et al. 2016; Olcese et al. 2016; Nghiem, Lina, et al. 2018). In contrast, conscious brain states may be described as less ordered, higher complexity (Sitt et al. 2014; Engemann et al. 2018; Nghiem, Lina, et al. 2018), more liquid-like. \n\nNext, we sought to determine whether phenomenological changes in microscopic coupling can be biophysically described by known differences in neuromodulation between brain states, and whether microscopic effects of neuromodulation can account for global differences in macroscopic brain dynamics. To this end, mean-field approximations describing populations of excitatory and inhibitory networks (El Boustani and Destexhe 2009; Volo et al. 2019) were connected based on diffusion tractography from human brains to be incorporated as nodes in TVB (Sanz-Leon et al. 2015), thus generating whole human brain simulations (Fig.4). Full brain TVB-AdEX models display spontaneous dynamics sensitive to the effects of neuromodulation, with low entropy, high energy states resulting from increased excitatory spike frequency adaptation resulting from decreased neuromodulation, as is the case in unconscious brain states. Conversely, TVB-AdEX models display spontaneous dynamics that are high entropy and low energy, similar to conscious brain states, when excitatory spike frequency adaptation is low, as is the case due to the enhancement of neuromodulatory signaling during waking and especially attentive brain states.\n\n![Figure 1](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/DestexheTeam/Goldman/Fig1_GoldmanSGA2_300px.jpeg)\n\n**Figure 1**: Quantifying observables in different brain states. A spectral energy measure, U, is introduced for each time epoch from each subject in each brain state (equation 1), calculated as the integral of each power spectrum. Similarly, a spectral entropy measure is defined, for each epoch from each subject in each brain state, where, P(f) describes the relative heights of power spectral frequency bins (equation 2).\n\n![Figure 2](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/DestexheTeam/Goldman/Fig2_GoldmanSGA2_400px.jpeg)\n\n**Figure 2**: Decreased spectral energy and increased spectral entropy in more active brain states. (A) Magentoencephalography (MEG) signals (X) from human subjects in resting and active states are used to compute (B) power spectra (X) for each subject, state, sensor, and epoch. Spectral energy (Eq.1) and entropy (Eq.2) are calculated from power spectra. (C) Energy and entropy across epochs for one subject in resting and active waking states. Between brain states, a significant shift in energy and entropy (Mann-Whitney U test, p-values reported) can be seen in histograms as well as a change in slope and intercept of the negative linear energy-entropy relation (best fit line shown, Pearson's r reported) as shown in the scatter plot. The inset labeled dS, dU implies a non-tautological relation between effective energy and entropy as measured empirically. Briefly, shifting power spectral offset results in changed energy values with no effect on entropy. Conversely, shuffling spectral energy between modes modulates the effective entropy, but not the energy. Variation of the spectral energy-entropy relation between brain states is robust across subjects. Mean spectral entropy (D) and mean spectral energy (E) are shown in active state against rest (one point per subject, identity line shown). In the resting state, spectral entropy is consistently smaller and energy larger than in the active state (Wilcoxon signed-rank test). Mean values of effective energy and entropy are shown from an independent dataset of electroencephalography, confirming the conservation of energy-entropy relationship across states of sleeping as well as waking (F).\n\n![Figure 3](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/DestexheTeam/Goldman/Fig3_GoldmanSGA2_400px.jpeg)\n\n**Figure 3**: Coupling modulates spectral energy and entropy. A parameter exploration of the Kuramoto model is performed in order to investigate effects of coupling on effective energy and entropy. Changing coupling strength, K, between oscillators causes a shift in spectral state variables. Increasing coupling robustly enhances the signal magnitude (A-D), captured by increased spectral energy (E) and diminishes signal complexity (A-D), quantified as diminished spectral entropy (E).\n\n![](https://object.cscs.ch/v1/AUTH_64bf8536ad8b4872a4121f909be7e82f/DestexheTeam/Goldman/Fig4_GoldmanSGA2_400px.jpeg)\n\n**Figure 4**: Neuromodulation-induced, microscopic changes in spike-frequency adaptation can account for macroscopic changes in state variables between brain states. Mean-field models of adaptive exponential excitatory and inhibitory neurons (adapted from Volo et al. 2019) represent nodes coupled together based on diffusion MRI tractography (A). Spike-frequency adaptation is increased to model the effects of decreased neuromodulation present during unconscious compared to conscious brain states (B-D). Enhancing excitatory spike frequency adaptation in the TVB-AdEx model results in a transition from small magnitude complex signals characteristic of waking brain states to slow waves characteristic of unconscious brain states.\n\n### References\n\nEl Boustani, Sami, and Alain Destexhe. 2009. “A Master Equation Formalism for Macroscopic Modeling of Asynchronous Irregular Activity States.” Neural Computation 21 (1): 46–100.\n\nEngemann, Denis A., Federico Raimondo, Jean-Rémi King, Benjamin Rohaut, Gilles Louppe, Frédéric Faugeras, Jitka Annen, et al. 2018. “Robust EEG-Based Cross-Site and Cross-Protocol Classification of States of Consciousness.” Brain: A Journal of Neurology 141 (11): 3179–92.\n\nGoldman, Jennifer S., Núria Tort-Colet, Matteo di Volo, Eduarda Susin, Jules Bouté, Melissa Dali, Mallory Carlu, Trang-Anh Nghiem, Tomasz Górski, and Alain Destexhe. 2019. “Bridging Single Neuron Dynamics to Global Brain States.” Frontiers in Systems Neuroscience 13 (December): 75.\n\nLe Van Quyen, Michel, Lyle E. Muller 2nd, Bartosz Telenczuk, Eric Halgren, Sydney Cash, Nicholas G. Hatsopoulos, Nima Dehghani, and Alain Destexhe. 2016. “High-Frequency Oscillations in Human and Monkey Neocortex during the Wake-Sleep Cycle.” Proceedings of the National Academy of Sciences of the United States of America 113 (33): 9363–68.\n\nNghiem, Trang-Anh, Jean-Marc Lina, Matteo di Volo, Cristiano Capone, Alan C. Evans, Alain Destexhe, and Jennifer S. Goldman. 2018. “State Equation from the Spectral Structure of Human Brain Activity.” arXiv [q-bio.NC]. arXiv. http://arxiv.org/abs/1806.07365.\n\nNghiem, Trang-Anh, Bartosz Telenczuk, Olivier Marre, Alain Destexhe, and Ulisse Ferrari. 2018. “Maximum-Entropy Models Reveal the Excitatory and Inhibitory Correlation Structures in Cortical Neuronal Activity.” Physical Review. E 98 (1-1): 012402.\n\nOlcese, Umberto, Jeroen J. Bos, Martin Vinck, Jan V. Lankelma, Laura B. van Mourik-Donga, Friederike Schlumm, and Cyriel M. A. Pennartz. 2016. “Spike-Based Functional Connectivity in Cerebral Cortex and Hippocampus: Loss of Global Connectivity Is Coupled to Preservation of Local Connectivity During Non-REM Sleep.” The Journal of Neuroscience: The Official Journal of the Society for Neuroscience 36 (29): 7676–92.\n\nPeyrache, Adrien, Nima Dehghani, Emad N. Eskandar, Joseph R. Madsen, William S. Anderson, Jacob A. Donoghue, Leigh R. Hochberg, Eric Halgren, Sydney S. Cash, and Alain Destexhe. 2012. “Spatiotemporal Dynamics of Neocortical Excitation and Inhibition during Human Sleep.” Proceedings of the National Academy of Sciences of the United States of America 109 (5): 1731–36.\n\nSanz-Leon, Paula, Stuart A. Knock, Andreas Spiegler, and Viktor K. Jirsa. 2015. “Mathematical Framework for Large-Scale Brain Network Modeling in The Virtual Brain.” NeuroImage 111 (May): 385–430.\n\nSchneidman, Elad, Michael J. Berry 2nd, Ronen Segev, and William Bialek. 2006. “Weak Pairwise Correlations Imply Strongly Correlated Network States in a Neural Population.” Nature 440 (7087): 1007–12.\n\nSitt, Jacobo Diego, Jean-Remi King, Imen El Karoui, Benjamin Rohaut, Frederic Faugeras, Alexandre Gramfort, Laurent Cohen, Mariano Sigman, Stanislas Dehaene, and Lionel Naccache. 2014. “Large Scale Screening of Neural Signatures of Consciousness in Patients in a Vegetative or Minimally Conscious State.” Brain: A Journal of Neurology 137 (Pt 8): 2258–70.\n\ndi Volo, Matteo di, Alberto Romagnoni, Cristiano Capone, and Alain Destexhe. 2019. “Biologically Realistic Mean-Field Models of Conductance-Based Networks of Spiking Neurons with Adaptation.” Neural Computation 31 (4): 653–80.\n\nZanoci, Cristian, Nima Dehghani, and Max Tegmark. 2019. “Ensemble Inhibition and Excitation in the Human Cortex: An Ising-Model Analysis with Uncertainties.” Physical Review. E 99 (3-1): 032408.",
    "contributors": [
      "Goldman, Jennifer",
      "Destexhe, Alain"
    ],
    "owners": [
      "Goldman, Jennifer"
    ],
    "citation": "",
    "dataDescriptor": null,
    "regions": [],
    "preparations": [],
    "methods": [],
    "modalities": [],
    "keywords": []
  }
]
