{
  "id": 3,
  "title": "Workflows",
  "description": null,
  "variant": "dark",
  "content": "",
  "content_cards": [
    {
      "title": "Hodgkin-Huxley Neuron Builder",
      "content": "Morphologies and NEURON .mod files available on the Hippocampus Hub Build section can be used in a model building workflow, namely the EBRAINS Hodgking Huxley Neuron Builder (HHNB), which allows to optimize a single cell NEURON model against electrophysiological data and run it on a dedicated simulation environment, the EBRAINS BlueNaas (NEURON As A Service). Explore the Morphologies and Models section on this portal or visit the HHNB page.",
      "actions": [{
        "label": "Start from Morphologies",
        "url": "/data/morphology"
      }, {
        "label": "Start from Models",
        "url": "/models"
      }, {
        "label": "Launch HH Neuron Builder",
        "url": "https://hhnb.ebrains-italy.eu/hh-neuron-builder/",
        "target": "_blank"
      }]
    },
    {
      "title": "Small Circuit In Silico Experiment: Rat Hippocampus CA1",
      "content": "The <strong>Small Circuit In Silico Experiment</strong> web app provides an extended toolset to configure and run simulations of hippocampal single cell models as well as multiple connected neurons from a given circuit. The application’s graphical user interface allows the user to define, in a first step, a small circuit composed of several connected neurons, and, in a second step, to experiment on this circuit by defining a stimulation and reporting protocol. The simulated activity can be downloaded in CSV format.",
      "actions": [{
        "label": "Launch the Small Circuit Simulator",
        "url": "https://pair-recording-bsp-epfl.apps.hbp.eu/circuits/rat-ca1",
        "target": "_blank"
      }]
    },
    {
      "title": "Brain Area Circuit In Silico Experiment: Rat Hippocampus CA1",
      "content": "The <strong>Brain Area Circuit In Silico Experiment</strong> web app allows to configure and launch a brain area simulation on HBP HPAC infrastructure using the <a href='https://www.unicore.eu/' target='_blank'>Unicore API</a>. Users can select the population of cells to be loaded, the number of synapses to be created and their strength, configure the stimulus duration and the stimulus shape as well as the report parameters.",
      "actions": [{
        "label": "Launch the Brain Area Simulator",
        "url": "https://simulation-launcher-bsp-epfl.apps.hbp.eu/index.html#/circuits/hippo_hbp_sa_full_ca1",
        "target": "_blank"
      }]
    }
  ],
  "slug": "workflows"
}